---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarCoverType.CoverDistance
source: html/f3945293-f356-cf97-b273-7ce1ace25468.htm
---
# Autodesk.Revit.DB.Structure.RebarCoverType.CoverDistance Property

A distance that can be used as a concrete cover value in a document.

## Syntax (C#)
```csharp
public double CoverDistance { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: coverDistance cannot be negative.